{
    "abraham_lincoln": {
        "name": "Abraham Lincoln",
        "description": "16th President of the United States",
        "category": "leader"
    },
    "ada_lovelace": {
        "name": "Ada Lovelace",
        "description": "Mathematician often recognized as the first computer programmer.",
        "category": "science"
    },
    "albert_einstein": {
        "name": "Albert Einstein",
        "description": "Theoretical physicist known for developing the theory of relativity.",
        "category": "science"
    },
    "amelia_earhart": {
        "name": "Amelia Earhart",
        "description": "First female aviator to fly solo across the Atlantic Ocean.",
        "category": "hero"
    },
    "carl_sagan": {
        "name": "Carl Sagan",
        "description": "Astronomer and science communicator known for research in extraterrestrial life.",
        "category": "science"
    },
    "cleopatra": {
        "name": "Cleopatra",
        "description": "Last active ruler of the Ptolemaic Kingdom of Egypt",
        "category": "leader"
    },
    "confucius": {
        "name": "Confucius",
        "description": "Ancient philosopher who significantly influenced East Asian culture and philosophy.",
        "category": "wisdom"
    },
    "frida_kahlo": {
        "name": "Frida Kahlo",
        "description": "Mexican artist renowned for her symbolic self-portraits.",
        "category": "art"
    },
    "george_washington": {
        "name": "George Washington",
        "description": "1st President of the United States",
        "category": "leader"
    },
    "harriet_tubman": {
        "name": "Harriet Tubman",
        "description": "Abolitionist who led hundreds of enslaved people to freedom.",
        "category": "hero"
    },
    "isaac_newton": {
        "name": "Isaac Newton",
        "description": "Scientist known for his influential contributions to physics, including his laws of motion.",
        "category": "science"
    },
    "julius_caesar": {
        "name": "Julius Caesar",
        "description": "Roman politician and general",
        "category": "leader"
    },
    "leonardo_da_vinci": {
        "name": "Leonardo da Vinci",
        "description": "High Renaissance polymath known for his diverse contributions to multiple fields.",
        "category": "science"
    },
    "louis_pasteur": {
        "name": "Louis Pasteur",
        "description": "French biologist, microbiologist and chemist renowned for his discoveries of the principles of vaccination, microbial fermentation and pasteurization",
        "category": "science"
    },
    "mahatma_gandhi": {
        "name": "Mahatma Gandhi",
        "description": "Leader of Indian nationalism who employed nonviolent resistance for independence.",
        "category": "leader"
    },
    "marie_curie": {
        "name": "Marie Curie",
        "description": "Physicist and chemist known for pioneering research on radioactivity.",
        "category": "science"
    },
    "maya_angelou": {
        "name": "Maya Angelou",
        "description": "An American poet, memoirist, and civil rights activist, she is best known for her series of seven autobiographies, which focus on her childhood and early adult experiences, the first and most famous of which is 'I Know Why the Caged Bird Sings'.",
        "category": "art"
    },
    "nelson_mandela": {
        "name": "Nelson Mandela",
        "description": "Anti-apartheid revolutionary, political leader, and former President of South Africa.",
        "category": "leader"
    },
    "nikola_tesla": {
        "name": "Nikola Tesla",
        "description": "Inventor and engineer who greatly contributed to the development of electrical systems.",
        "category": "science"
    },
    "queen_victoria": {
        "name": "Queen Victoria",
        "description": "Queen of the United Kingdom of Great Britain and Ireland from 1837 until her death",
        "category": "leader"
    },
    "robin_hood": {
        "name": "Robin Hood",
        "description": "A heroic outlaw in English folklore who, according to legend, was a highly skilled archer and swordsman",
        "category": "fictional"
    },
    "sherlock_holmes": {
        "name": "Sherlock Holmes",
        "description": "A fictional private detective created by British author Sir Arthur Conan Doyle",
        "category": "fictional"
    },
    "dracula": {
        "name": "Dracula",
        "description": "A vampire who is fabled to haunt the Carpathian Mountains",
        "category": "fictional"
    },
    "king_arthur": {
        "name": "King Arthur",
        "description": "A legendary British leader who, according to medieval histories and romances, led the defense of Britain against Saxon invaders in the late 5th and early 6th centuries",
        "category": "fictional"
    },
    "hermione_granger": {
        "name": "Hermione Granger",
        "description": "A key character in the Harry Potter series, Harry's best friend, and a talented and intelligent witch",
        "category": "fictional"
    },
    "harry_potter": {
        "name": "Harry Potter",
        "description": "The protagonist of J.K. Rowling's fantasy novel series about a young wizard and his adventures at Hogwarts School of Witchcraft and Wizardry",
        "category": "fictional"
    },
    "james_bond": {
        "name": "James Bond",
        "description": "A fictional British secret agent created by writer Ian Fleming, known for his sophistication, gadgets, and thrilling espionage missions",
        "category": "fictional"
    },
    "lara_croft": {
        "name": "Lara Croft",
        "description": "The main protagonist of the Tomb Raider video game series, an archaeologist-adventurer who explores ancient tombs and uncovers hidden treasures",
        "category": "fictional"
    },
    "atticus_finch": {
        "name": "Atticus Finch",
        "description": "A fictional character in Harper Lee's novel 'To Kill a Mockingbird,' a lawyer known for his moral integrity and his defense of a wrongly accused African American man",
        "category": "fictional"
    },
    "snow_white": {
        "name": "Snow White",
        "description": "The protagonist of the fairy tale and Disney film 'Snow White and the Seven Dwarfs,' known for her beauty and kind-hearted nature",
        "category": "fictional"
    },
    "alice": {
        "name": "Alice",
        "description": "The central character in Lewis Carroll's 'Alice's Adventures in Wonderland,' a young girl who falls into a whimsical and nonsensical world",
        "category": "fictional"
    },
    "don_quixote": {
        "name": "Don Quixote",
        "description": "The main character in Miguel de Cervantes' novel 'Don Quixote,' a middle-aged man who sets out on a quest to revive chivalry and battle imaginary foes",
        "category": "fictional"
    },
    "dorothy_gale": {
        "name": "Dorothy Gale",
        "description": "The main character in many of the Oz novels by L. Frank Baum, best known from 'The Wonderful Wizard of Oz'.",
        "category": "fictional"
    },
    "charles_darwin": {
        "name": "Charles Darwin",
        "description": "English naturalist, geologist and biologist, best known for his contributions to the science of evolution.",
        "category": "science"
    },
    "winston_churchill": {
        "name": "Winston Churchill",
        "description": "British statesman, army officer, and writer who served as Prime Minister of the United Kingdom during the Second World War.",
        "category": "leader"
    },
    "martin_luther_king_jr": {
        "name": "Martin Luther King Jr.",
        "description": "American Christian minister and activist who became the most visible spokesperson and leader in the Civil Rights Movement from 1955 until his assassination in 1968.",
        "category": "hero"
    },
    "joan_of_arc": {
        "name": "Joan of Arc",
        "description": "Nicknamed 'The Maid of Orléans', she is considered a heroine of France for her role during the Lancastrian phase of the Hundred Years' War.",
        "category": "hero"
    },
    "beethoven": {
        "name": "Ludwig van Beethoven",
        "description": "German composer and pianist whose music is amongst the most performed of the classical music repertoire.",
        "category": "art"
    },
    "hercules": {
        "name": "Hercules",
        "description": "A divine hero in Greek mythology, the son of Zeus and the mortal Alcmene.",
        "category": "fictional"
    },
    "frodo_baggins": {
        "name": "Frodo Baggins",
        "description": "A main character in J. R. R. Tolkien's 'The Lord of the Rings' who carries the One Ring to Mount Doom.",
        "category": "fictional"
    },
    "luke_skywalker": {
        "name": "Luke Skywalker",
        "description": "A key figure in the Star Wars universe, trained by Obi-Wan Kenobi and Yoda to become a Jedi and defeat the Galactic Empire.",
        "category": "fictional"
    },
    "elizabeth_bennet": {
        "name": "Elizabeth Bennet",
        "description": "The protagonist in Jane Austen's 1813 novel 'Pride and Prejudice'.",
        "category": "fictional"
    },
    "darcy": {
        "name": "Fitzwilliam Darcy",
        "description": "One of the two central characters in Jane Austen's 1813 novel 'Pride and Prejudice'.",
        "category": "fictional"
    },
    "huckleberry_finn": {
        "name": "Huckleberry Finn",
        "description": "The protagonist and narrator of novels 'The Adventures of Tom Sawyer' and 'Adventures of Huckleberry Finn', by Mark Twain.",
        "category": "fictional"
    },
    "romeo_juliet": {
        "name": "Romeo and Juliet",
        "description": "The title characters in William Shakespeare's tragedy who fall in love despite their feuding families.",
        "category": "fictional"
    },
    "tarzan": {
        "name": "Tarzan",
        "description": "A fictional character, an archetypal feral child raised in the African jungle by the Mangani great apes; he later experiences civilization only to reject it and return to the wild as a heroic adventurer.",
        "category": "fictional"
    },
    "thomas_jefferson": {
        "name": "Thomas Jefferson",
        "description": "American statesman, diplomat, lawyer, architect, philosopher, and Founding Father who served as the third president of the United States from 1801 to 1809.",
        "category": "leader"
    },
    "florence_nightingale": {
        "name": "Florence Nightingale",
        "description": "British nurse, social reformer and statistician known as the founder of modern nursing.",
        "category": "hero"
    },
    "william_shakespeare": {
        "name": "William Shakespeare",
        "description": "English playwright, poet, and actor, widely regarded as the greatest writer in the English language and the world's greatest dramatist.",
        "category": "art"
    },
    "picasso": {
        "name": "Pablo Picasso",
        "description": "Spanish painter, sculptor, printmaker, ceramicist, and theatre designer who spent most of his adult life in France and is regarded as one of the most influential artists of the 20th century.",
        "category": "art"
    },
    "charlie_chaplin": {
        "name": "Charlie Chaplin",
        "description": "English comic actor, filmmaker, and composer who rose to fame in the era of silent film and is best known for his character 'The Tramp'.",
        "category": "art"
    },
    "susan_b_anthony": {
        "name": "Susan B. Anthony",
        "description": "American social reformer and women's rights activist who played a pivotal role in the women's suffrage movement.",
        "category": "hero"
    },
    "walt_disney": {
        "name": "Walt Disney",
        "description": "American entrepreneur, animator, writer, voice actor and film producer who co-founded The Walt Disney Company.",
        "category": "art"
    },
    "neil_armstrong": {
        "name": "Neil Armstrong",
        "description": "American astronaut and aeronautical engineer, and the first person to walk on the Moon.",
        "category": "hero"
    },
    "muhammad_ali": {
        "name": "Muhammad Ali",
        "description": "American professional boxer, activist, and philanthropist, widely regarded as one of the most significant and celebrated sports figures of the 20th century.",
        "category": "hero"
    },
    "bilbo_baggins": {
        "name": "Bilbo Baggins",
        "description": "The protagonist of J. R. R. Tolkien's 'The Hobbit', Bilbo is a hobbit who is coerced into going on an adventure to reclaim the kingdom of Erebor from the dragon Smaug.",
        "category": "fictional"
    },
    "heathcliff": {
        "name": "Heathcliff",
        "description": "A character in Emily Bronte's 'Wuthering Heights', Heathcliff is a passionate and vengeful man who endures a torturous love for Catherine Earnshaw.",
        "category": "fictional"
    },
    "nancy_drew": {
        "name": "Nancy Drew",
        "description": "The title character in a mystery series created by publisher Edward Stratemeyer, Nancy is a teenage detective who solves mysteries with her friends.",
        "category": "fictional"
    },
    "vito_corleone": {
        "name": "Vito Corleone",
        "description": "The patriarch of the Corleone family in Mario Puzo's 'The Godfather', Vito is an Italian immigrant who builds a mafia empire.",
        "category": "fictional"
    },
    "hamlet": {
        "name": "Hamlet",
        "description": "The Prince of Denmark, the title character, and the protagonist in Shakespeare's play 'Hamlet'. He struggles with the moral legitimacy of revenge, his own sanity, and the authenticity of his mother’s and friends’ seeming betrayal.",
        "category": "fictional"
    },
    "scarlett_o_hara": {
        "name": "Scarlett O'Hara",
        "description": "The protagonist in Margaret Mitchell's 'Gone With the Wind', Scarlett is a Southern belle who survives the Civil War and Reconstruction.",
        "category": "fictional"
    },
    "jay_gatsby": {
        "name": "Jay Gatsby",
        "description": "The title character of F. Scott Fitzgerald's 'The Great Gatsby', Gatsby is a millionaire and a man of mystery with a shady past and a love for Daisy Buchanan.",
        "category": "fictional"
    },
    "winnie_the_pooh": {
        "name": "Winnie the Pooh",
        "description": "A character in A. A. Milne's 'Winnie-the-Pooh' series, Winnie the Pooh is a loveable bear known for his love of honey and his simple, but profound, wisdom.",
        "category": "fictional"
    },
    "holden_caulfield": {
        "name": "Holden Caulfield",
        "description": "The protagonist of J.D. Salinger's 'The Catcher in the Rye', Holden is a teenager who navigates the challenges of adolescence and alienation.",
        "category": "fictional"
    }
}