{
    "albert_einstein": {
        "name": "Albert Einstein",
        "description": "An influential theoretical physicist who developed the theory of relativity, fundamentally shifting our understanding of space, time, and energy."
    },
    "harriet_tubman": {
        "name": "Harriet Tubman",
        "description": "An African American abolitionist and political activist who led hundreds of enslaved people to freedom via the Underground Railroad."
    },
    "nikola_tesla": {
        "name": "Nikola Tesla",
        "description": "A Serbian-American inventor and engineer who significantly contributed to the development of alternating current electrical systems, envisioned wireless communication, and held over 300 patents."
    },
    "frida_kahlo": {
        "name": "Frida Kahlo",
        "description": "A Mexican artist known for her surrealist and symbolic self-portraits and works that explored identity, gender, class, and race in Mexican society."
    },
    "confucius": {
        "name": "Confucius",
        "description": "An ancient Chinese philosopher whose teachings formed the basis of many aspects of East Asian culture and philosophy, emphasizing personal and governmental morality, correctness of social relationships, and justice."
    },
    "amelia_earhart": {
        "name": "Amelia Earhart",
        "description": "An American aviation pioneer and author, she was the first female aviator to fly solo across the Atlantic Ocean, symbolizing the expanding roles of women in the early 20th century."
    },
    "mahatma_gandhi": {
        "name": "Mahatma Gandhi",
        "description": "Leader of Indian nationalism in British-ruled India, who employed nonviolent resistance to lead India to independence and inspired civil rights movements worldwide."
    },
    "ada_lovelace": {
        "name": "Ada Lovelace",
        "description": "An English mathematician and writer who is recognized for her work on Charles Babbage's early mechanical general-purpose computer, the Analytical Engine, and is often regarded as the first computer programmer."
    },
    "virginia_woolf": {
        "name": "Virginia Woolf",
        "description": "An English writer and one of the foremost modernists of the twentieth century, Woolf's works have significantly influenced feminist criticism and she is celebrated for her innovative narrative techniques."
    },
    "nelson_mandela": {
        "name": "Nelson Mandela",
        "description": "An anti-apartheid revolutionary, political leader, and philanthropist, who served as President of South Africa, and whose leadership, resilience, and advocacy for equality and justice transformed his nation."
    },
    "zora_neale_hurston": {
        "name": "Zora Neale Hurston",
        "description": "An American author, anthropologist, and filmmaker, who portrayed racial struggles in the early-20th-century American South and published research on Haitian voodoo."
    },
    "carl_sagan": {
        "name": "Carl Sagan",
        "description": "An American astronomer, planetary scientist, cosmologist, astrophysicist, astrobiologist, author, and science communicator known for his research in extraterrestrial life, and for popularizing science to the public."
    },
    "cleopatra": {
        "name": "Cleopatra",
        "description": "Last active ruler of the Ptolemaic Kingdom of Egypt"
    },
    "abraham_lincoln": {
        "name": "Abraham Lincoln",
        "description": "16th President of the United States"
    },
    "george_washington": {
        "name": "George Washington",
        "description": "1st President of the United States"
    },
    "julius_caesar": {
        "name": "Julius Caesar",
        "description": "Roman politician and general"
    },
    "queen_victoria": {
        "name": "Queen Victoria",
        "description": "Queen of the United Kingdom of Great Britain and Ireland from 1837 until her death"
    },
    "marie_curie": {
        "name": "Marie Curie",
        "description": "Polish and naturalized-French physicist and chemist"
    },
    "isaac_newton": {
        "name": "Isaac Newton",
        "description": "English mathematician, physicist, astronomer, theologian, and author"
    },
    "galileo_galilei": {
        "name": "Galileo Galilei",
        "description": "Italian astronomer, physicist and engineer"
    },
    "charles_darwin": {
        "name": "Charles Darwin",
        "description": "English naturalist, geologist and biologist"
    },
    "maya_angelou": {
        "name": "Maya Angelou",
        "description": "An American poet, memoirist, and civil rights activist, she is best known for her series of seven autobiographies, which focus on her childhood and early adult experiences, the first and most famous of which is 'I Know Why the Caged Bird Sings'."
    },
    "leonardo_da_vinci": {
        "name": "Leonardo da Vinci",
        "description": "Italian polymath of the High Renaissance who is widely considered one of the most diversely talented individuals ever to have lived"
    },
    "louis_pasteur": {
        "name": "Louis Pasteur",
        "description": "French biologist, microbiologist and chemist renowned for his discoveries of the principles of vaccination, microbial fermentation and pasteurization"
    },
    "the_easter_bunny": {
        "name": "The Easter Bunny",
        "description": "A folkloric figure and symbol of Easter, depicted as a rabbit bringing Easter eggs"
    },
    "the_tooth_fairy": {
        "name": "The Tooth Fairy",
        "description": "A fantasy figure of early childhood in Western and Western-influenced cultures"
    },
    "santa_claus": {
        "name": "Santa Claus",
        "description": "A legendary figure originating in Western Christian culture who is said to bring gifts to the homes of well-behaved children on the night of Christmas Eve"
    },
    "robin_hood": {
        "name": "Robin Hood",
        "description": "A heroic outlaw in English folklore who, according to legend, was a highly skilled archer and swordsman"
    },
    "sherlock_holmes": {
        "name": "Sherlock Holmes",
        "description": "A fictional private detective created by British author Sir Arthur Conan Doyle"
    },
    "dracula": {
        "name": "Dracula",
        "description": "A vampire who is fabled to haunt the Carpathian Mountains"
    }
}